jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
<?xml version='1.0' encoding='UTF-8'?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_3.xsd" schemaVersion="1.3">
  <vendor>Infineon</vendor>
  <name>TLE9563</name>
  <version>0.2.0</version>
  <description>TLE9563</description>
  <addressUnitBits>8</addressUnitBits>
  <width>8</width>
  <peripherals>
    <peripheral>
      <name>TLE9563</name>
      <description>TLE9563 Module</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>M_S_CTRL</name>
          <description>Mode and Supply Control</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xE7</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Device Mode Control</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NORMAL, Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> SLEEP, Sleep Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> STOP, Stop Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> RESET, Device reset Soft reset is executed (configuration of RSTN triggering in bit SOFT_RESET_RO)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCC1_OV_MOD</name>
              <description>Reaction in case of VCC1 Over Voltage</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO, no reaction</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> INTN, INTN event is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> RSTN, RSTN event is generated</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> FAILSAFE, Fail-Safe Mode is entered</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTN_HYS</name>
              <description>VCC1 Undervoltage Reset Hysteresis Selection (see also Chapter 12.7.1 for more information)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DEFAULT, default hysteresis applies as specified in the electrical characteristics table</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGHEST, the highest rising threshold (VRT1,R) is always used for the release of the undervoltage reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I_PEAK_TH</name>
              <description>VCC1 Active Peak Threshold Selection</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, low VCC1 active peak threshold selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, high VCC1 active peak threshold selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCC1_RT</name>
              <description>VCC1 Reset Threshold Control</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> VRT1, Vrt1 selected (highest threshold)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> VRT2, Vrt2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> VRT3, Vrt3 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> VRT4, Vrt4 selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_CTRL</name>
          <description>Hardware Control</description>
          <addressOffset>0x02</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x5E</resetMask>
          <fields>
            <field>
              <name>TSD2_DEL</name>
              <description>TSD2 minimum Waiting Time Selection</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 1s, Minimum waiting time until TSD2 is released again is always 1 s</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 64s, Minimum waiting time until TSD2 is released again is 1 s, after &gt;16 TSD2 consecutive events, it will extended x 64</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS_OV_SEL</name>
              <description>VS OV comparator threshold change</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 20V, Default threshold setting (VS,OVD1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 30V, increased threshold setting (VS,OVD2)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SH_DISABLE</name>
              <description>Sample and hold circuitry disable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ENABLED, Gate driver S&amp;H circuitry enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, Gate driver S&amp;H circuitry disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTN_DEL</name>
              <description>Reset delay time</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 10ms, Reset delay time 10 ms (tRD1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 2ms, Reset delay time to 2 ms (tRD2)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFT_RESET_RO</name>
              <description>Soft Reset Configuration</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> RSTN, RSTN will be triggered (pulled low) during a Soft Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> NO_RSTN, no RSTN trigger during a Soft Reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD_STM_EN_1</name>
              <description>Watchdog Deactivation during Stop Mode, bit1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ACTIVE, Watchdog is active in Stop Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> INACTIVE, Watchdog is deactivated in Stop Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_CTRL</name>
          <description>Watchdog Control</description>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xF7</resetMask>
          <fields>
            <field>
              <name>CHECKSUM</name>
              <description>Watchdog Setting Check Sum Bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 0, Counts as 0 for checksum calculation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 1, Counts as 1 for checksum calculation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD_STM_EN_0</name>
              <description>Watchdog Deactivation during Stop Mode, bit0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ACTIVE, Watchdog is active in Stop Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> INACTIVE, Watchdog is deactivated in Stop Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD_CFG</name>
              <description>Watchdog Configuration</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> TIMEOUT, Watchdog works as a Time-Out watchdog</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WINDOW, Watchdog works as a Window watchdog</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD_EN_WK_BUS</name>
              <description>Watchdog Enable after Bus Wake in Stop Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Watchdog will not start after a CAN wake-up event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, Watchdog starts with a long open window after CAN Wake-up event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD_TIMER</name>
              <description>Watchdog Timer Period</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>10ms, 10ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>20ms, 20ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>50ms, 50ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>100ms, 100ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>200ms, 200ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>500ms, 500ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>1s, 1s</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>10s, 10s</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_CTRL</name>
          <description>CAN Control</description>
          <addressOffset>0x06</addressOffset>
          <size>16</size>
          <resetValue>0x20</resetValue>
          <resetMask>0x07</resetMask>
          <fields>
            <field>
              <name>CAN</name>
              <description>HS-CAN Module Modes</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>OFF, CAN OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>WAKE, CAN is wake capable (no SWK)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>RECEIVE, CAN Receive Only Mode (no SWK)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>NORMAL, CAN Normal Mode (no SWK)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>OFF, CAN OFF</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>WAKE_SWK, CAN is wake capable with SWK</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>RECEIVE_SWK, CAN Receive Only Mode with SWK</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>NORMAL_SWK, CAN Normal Mode with SWK</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
