jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>WK_CTRL_BNK3</name>
          <description>Wake-up Control</description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <resetValue>0x20</resetValue>
          <resetMask>0x7F</resetMask>
          <fields>
            <field>
              <name>WK_FILT</name>
              <description>Wake-up Filter Time Configuration</description>
              <lsb>11</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>16us, Filter with 16 i.ts filter time (static sensing) </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>64us, Filter with 64 i.ts filter time (static sensing) </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>TIMER1, Filtering at the end of the on-time; filter</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>TIMER2, Filtering at the end of the on-time; filter</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>SYNC, Filter at the end of settle time (80 i.ts), filter time of 16 i.ts (cyclic sensing) is selected, SYNC1)2) </description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>, reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>, reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK_PUPD</name>
              <description>WKx Pull-Up/Pull-Down Configuration</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO, No pull-up/pull-down selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> PULL_DOWN, Pull-down resistor selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> PULL_UP, Pull-up resistor selected3)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> AUTO, Automatic switching to pull-up or pull-down</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK_EN</name>
              <description>WKx Enable</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> WK_OFF, WKx module OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WK_ON, WKx module ON</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> SYNC, OFF or (in case of WK4), it is configured as SYNC input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> OFF, OFF</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK_BNK</name>
              <description>WKs input Banking</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>WK4, WK4 Module (Bank 4)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>WK5, WK5 Module (Bank 5)3)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>, reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>, reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WK_CTRL_BNK4</name>
          <description>Wake-up Control</description>
          <addressOffset>0x0a</addressOffset>
          <size>16</size>
          <resetValue>0x20</resetValue>
          <resetMask>0x7F</resetMask>
          <fields>
            <field>
              <name>WK_FILT</name>
              <description>Wake-up Filter Time Configuration</description>
              <lsb>11</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>16us, Filter with 16 i.ts filter time (static sensing) </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>64us, Filter with 64 i.ts filter time (static sensing) </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>TIMER1, Filtering at the end of the on-time; filter</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>TIMER2, Filtering at the end of the on-time; filter</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>SYNC, Filter at the end of settle time (80 i.ts), filter time of 16 i.ts (cyclic sensing) is selected, SYNC1)2) </description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>, reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>, reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK_PUPD</name>
              <description>WKx Pull-Up/Pull-Down Configuration</description>
              <lsb>9</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO, No pull-up/pull-down selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> PULL_DOWN, Pull-down resistor selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> PULL_UP, Pull-up resistor selected3)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> AUTO, Automatic switching to pull-up or pull-down</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK_EN</name>
              <description>WKx Enable</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> WK_OFF, WKx module OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WK_ON, WKx module ON</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> SYNC, OFF or (in case of WK4), it is configured as SYNC input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> OFF, OFF</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK_BNK</name>
              <description>WKs input Banking</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>WK4, WK4 Module (Bank 4)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>WK5, WK5 Module (Bank 5)3)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>, reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>, reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CTRL</name>
          <description>Timer 1 and Timer2 Control and Selection</description>
          <addressOffset>0x0c</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFEE</resetMask>
          <fields>
            <field>
              <name>TIMER2_ON</name>
              <description>Timer2 On-Time Configuration</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>OFF_LOW, OFF / Low (timer not running, HSx output is low)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>100us, 0.1ms on-time</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>300us, 0.3ms on-time</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>1ms, 1.0ms on-time</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>10ms, 10ms on-time</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>20ms, 20ms on-time</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>OFF_HIGH, OFF / HIGH (timer not running, HSx</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>, reserved, same behaviour as 110B</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER2_PER</name>
              <description>Timer2 Period Configuration</description>
              <lsb>9</lsb>
              <msb>11</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>10ms, 10ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>20ms, 20ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>50ms, 50ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>100ms, 100ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>200ms, 200ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>500ms, 500ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>1s, 1s</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>2s, 2s</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CYCWK</name>
              <description>Cyclic Wake Configuration</description>
              <lsb>7</lsb>
              <msb>8</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Timer1 and Timer2 disabled as wake-up sources</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> TIMER1, Timer1 is enabled as wake-up source (Cyclic Wake)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> TIMER2, Timer2 is enabled as wake-up source (Cyclic Wake)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> , reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER1_ON</name>
              <description>Timer1 On-Time Configuration</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>OFF_LOW, OFF / Low (timer not running, HSx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>100us, 0.1ms on-time</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>300us, 0.3ms on-time</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>1ms, 1.0ms on-time</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>10ms, 10ms on-time</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>20ms, 20ms on-time</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>OFF_HIGH, OFF / HIGH (timer not running, HSx output is high)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>, reserved, same behaviour as 110B</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER1_PER</name>
              <description>Timer1 Period Configuration</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>10ms, 10ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>20ms, 20ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>50ms, 50ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>100ms, 100ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>200ms, 200ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>500ms, 500ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>1s, 1s</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>2s, 2s</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
