jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>SW_SD_CTRL</name>
          <description>High-Side Switch Shutdown Control</description>
          <addressOffset>0x0e</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFB7A</resetMask>
          <fields>
            <field>
              <name>HS3_OV_REC</name>
              <description>Switch recovery after removal of VS Overvoltage for HS3</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Switch recovery is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> PREVIOUS, Previous state before VS Overvoltage is enabled after Overvoltage considtion is removed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS2_OV_REC</name>
              <description>Switch recovery after removal of VS Overvoltage for HS2</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Switch recovery is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> PREVIOUS, Previous state before VS Overvoltage is enabled after Overvoltage considtion is removed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS1_OV_REC</name>
              <description>Switch recovery after removal of VS Overvoltage for HS1</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Switch recovery is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> PREVIOUS, Previous state before VS Overvoltage is enabled after Overvoltage considtion is removed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS_OT_SD_DIS</name>
              <description>Shutdown Disabling of all HS in case of Overtemperature event</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ALL, shudown for all HSx in case of Overtemperature</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> INDIVIDUAL, individual shudown in case of Overtemperature</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS3_OV_SDN_DIS</name>
              <description>Shutdown Disabling of HS3 in case of input supply overvoltage in Normal Mode</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ENABLED, shudown enabled in case of VS Overvoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, shudown disabled in case of VS Overvoltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS2_OV_SDN_DIS</name>
              <description>Shutdown Disabling of HS2 in case of input supply overvoltage in Normal Mode</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ENABLED, shudown enabled in case of VS Overvoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DIASBLED, shudown disabled in case of VS Overvoltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS1_OV_SDN_DIS</name>
              <description>Shutdown Disabling of HS1 in case of input supply overvoltage in Normal Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ENABLED, shudown enabled in case of VS Overvoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, shudown disabled in case of VS Overvoltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS_OV_SDS_DIS</name>
              <description>Shutdown Disabling of HSx in case of input supply overvoltage in Stop Mode or Sleep Mode</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ENABLED, shudown enabled in case of VS Overvoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, shudown disabled in case of VS Overvoltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS_UV_SD_DIS</name>
              <description>Shutdown Disabling of HSx in case of input supply undervoltage</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ENABLED, shudown enabled in case of VS Undervoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, shudown disabled in case of VS Undervoltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS_UV_REC</name>
              <description>Switch recovery after removal of Undervoltage for HSx</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Switch recovery is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> PREVIOUS, Previous state before VS</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HS_CTRL</name>
          <description>High-Side Switch Control</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF0E</resetMask>
          <fields>
            <field>
              <name>HS3</name>
              <description>HS3 Configuration</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>OFF, OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ON, ON</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>TIMER1, Controlled by Timer1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>TIMER2, Controlled by Timer2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>PWM1, Controlled by PWM1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>PWM2, Controlled by PWM2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>PWM3, Controlled by PWM3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>PWM4, Controlled by PWM4</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value9</name>
                  <description>WK4_SYNC, Synchronized with WK4/SYNC</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS2</name>
              <description>HS2 Configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>OFF, OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ON, ON</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>TIMER1, Controlled by Timer1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>TIMER2, Controlled by Timer2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>PWM1, Controlled by PWM1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>PWM2, Controlled by PWM2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>PWM3, Controlled by PWM3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>PWM4, Controlled by PWM4</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value9</name>
                  <description>WK4_SYNC, Synchronized with WK4/SYNC</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS1</name>
              <description>HS1 Configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>OFF, OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ON, ON</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>TIMER1, Controlled by Timer1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>TIMER2, Controlled by Timer2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>PWM1, Controlled by PWM1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>PWM2, Controlled by PWM2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>PWM3, Controlled by PWM3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>PWM4, Controlled by PWM4</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value9</name>
                  <description>WK4_SYNC, Synchronized with WK4/SYNC</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
