jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>INT_MASK</name>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <resetValue>0x140</resetValue>
          <resetMask>0xFF00</resetMask>
          <fields>
            <field>
              <name>INTN_CYC_EN</name>
              <description>Periodical INTN generation</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, no periodical INTN event generated in case of pending interrupts</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, periodical INTN event generated in case of pending interrupts</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD_SDM_DISABLE</name>
              <description>Disable Watchdog in Software Development Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ENABLED, WD is enabled in Software Development Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, WD is disabled in Software Development Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD_SDM</name>
              <description>Watchdog failure in Software Development Mode</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, no INTN event generated in case of WD trigger failure in Software Development Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, one INTN event is generated in case of WD trigger failure in Software Development Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI_CRC_FAIL</name>
              <description>SPI and CRC interrupt generation</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, no INTN event generated in case of SPI_FAIL or CRC_FAIL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, one INTN event is generated n case of SPI_FAIL or CRC_FAIL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BD_STAT</name>
              <description>Bridge Driver Interrupt generation</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, no INTN event generated in case BD_STAT (on Status Information Field) is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, one INTN event generated in case BD_STAT (on Status Information Field) is set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS_STAT</name>
              <description>High Side Interrupt generation</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, no INTN event generated in case HS_STAT (on Status Information Field) is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, one INTN event generated in case HS_STAT (on Status Information Field) is set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUS_STAT</name>
              <description>BUS Interrupt generation</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, no INTN event generated in case BUS_STAT (on Status Information Field) is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, one INTN event generated in case BUS_STAT (on Status Information Field) is set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP_STAT</name>
              <description>Temperature Interrupt generation</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, no INTN event generated in case TEMP_STAT (on Status Information Field) is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, one INTN event generated in case TEMP_STAT (on Status Information Field) is set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPPLY_STAT</name>
              <description>SUPPLY Status Interrupt generation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, no INTN event generated in case SUPPLY_STAT (on Status Information Field) is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, one INTN event generated in case SUPPLY_STAT (on Status Information Field) is set</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_CTRL_BNK0</name>
          <description>PWM Configuration Control</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF7E</resetMask>
          <fields>
            <field>
              <name>PWM_FREQ</name>
              <description>PWM generator Frequency Setting</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 100Hz, 100Hz is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 200Hz, 200Hz is selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_DC</name>
              <description>PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) </description>
              <lsb>4</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_BNK</name>
              <description>Internal PWM generator selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PWM1, PWM1 Module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>PWM2, PWM2 Module</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>PWM3, PWM3 Module</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>PWM4, PWM4 Module</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_CTRL_BNK1</name>
          <description>PWM Configuration Control</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF7E</resetMask>
          <fields>
            <field>
              <name>PWM_FREQ</name>
              <description>PWM generator Frequency Setting</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 100Hz, 100Hz is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 200Hz, 200Hz is selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_DC</name>
              <description>PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) </description>
              <lsb>4</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_BNK</name>
              <description>Internal PWM generator selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PWM1, PWM1 Module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>PWM2, PWM2 Module</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>PWM3, PWM3 Module</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>PWM4, PWM4 Module</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_CTRL_BNK2</name>
          <description>PWM Configuration Control</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF7E</resetMask>
          <fields>
            <field>
              <name>PWM_FREQ</name>
              <description>PWM generator Frequency Setting</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 100Hz, 100Hz is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 200Hz, 200Hz is selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_DC</name>
              <description>PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) </description>
              <lsb>4</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_BNK</name>
              <description>Internal PWM generator selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PWM1, PWM1 Module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>PWM2, PWM2 Module</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>PWM3, PWM3 Module</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>PWM4, PWM4 Module</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_CTRL_BNK3</name>
          <description>PWM Configuration Control</description>
          <addressOffset>0x1a</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF7E</resetMask>
          <fields>
            <field>
              <name>PWM_FREQ</name>
              <description>PWM generator Frequency Setting</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 100Hz, 100Hz is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 200Hz, 200Hz is selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_DC</name>
              <description>PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB) </description>
              <lsb>4</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM_BNK</name>
              <description>Internal PWM generator selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PWM1, PWM1 Module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>PWM2, PWM2 Module</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>PWM3, PWM3 Module</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>PWM4, PWM4 Module</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_STAT_CTRL</name>
          <description>System Status Control</description>
          <addressOffset>0x1c</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>SYS_STAT</name>
              <description>System Status Control (bit0=LSB; bit15=MSB) Dedicated bytes for system configuration, access only by microcontroller. Cleared after power up and soft reset.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
