jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>CCP_BLK_BNK4</name>
          <description>CCP and times selection</description>
          <addressOffset>0x2c</addressOffset>
          <size>16</size>
          <resetValue>0x7700</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>TBLANK</name>
              <description>Blank time</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCCP</name>
              <description>Cross-current protection time</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCP_BNK</name>
              <description>Cross-current and time banking</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active blank and cross-current prot. times for HB1 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active blank and cross-current prot. times for HB2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active blank and cross-current prot. times for HB3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW blank and cross-current prot. times for HB1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW blank and cross-current prot. times for HB2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW blank and cross-current prot. for times for HB3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCP_BLK_BNK5</name>
          <description>CCP and times selection</description>
          <addressOffset>0x2e</addressOffset>
          <size>16</size>
          <resetValue>0x7700</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>TBLANK</name>
              <description>Blank time</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCCP</name>
              <description>Cross-current protection time</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCP_BNK</name>
              <description>Cross-current and time banking</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active blank and cross-current prot. times for HB1 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active blank and cross-current prot. times for HB2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active blank and cross-current prot. times for HB3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW blank and cross-current prot. times for HB1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW blank and cross-current prot. times for HB2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW blank and cross-current prot. for times for HB3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCP_BLK_BNK6</name>
          <description>CCP and times selection</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <resetValue>0x7700</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>TBLANK</name>
              <description>Blank time</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCCP</name>
              <description>Cross-current protection time</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCP_BNK</name>
              <description>Cross-current and time banking</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active blank and cross-current prot. times for HB1 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active blank and cross-current prot. times for HB2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active blank and cross-current prot. times for HB3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW blank and cross-current prot. times for HB1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW blank and cross-current prot. times for HB2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW blank and cross-current prot. for times for HB3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HBMODE</name>
          <description>Half-Bridge MODE</description>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <resetValue>0x222</resetValue>
          <resetMask>0xFF0E</resetMask>
          <fields>
            <field>
              <name>HB3MODE</name>
              <description>Half-bridge 3 MODE selection</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> PASSIVE_OFF, LS3 and HS3 are off by passive discharge (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> LS3_ON, LS3 is ON</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> HS3_ON, HS3 is ON</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> ACTIVE_OFF, LS3 and HS3 kept off by the active discharge</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFW3</name>
              <description>Active freewheeling for half-bridge 3 during PWM</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, active freewheeling disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, active freewheeling enabled (default)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB3_PWM_EN</name>
              <description>PWM mode for half-bridge 3</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> INACTIVE, PWM deactivated for HB2(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ACTIVE, PWM activated for HB2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB2MODE</name>
              <description>Half-bridge 2 MODE selection</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> PASSIVE_OFF, LS2 and HS2 are off by passive discharge (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> LS2_ON, LS2 is ON</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> HS2_ON, HS2 is ON</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> ACTIVE_OFF, LS2 and HS2 kept off by the active discharge</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFW2</name>
              <description>Active freewheeling for half-bridge 2 during PWM</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, active freewheeling disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, active freewheeling enabled (default)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB2_PWM_EN</name>
              <description>PWM mode for half-bridge 2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> INACTIVE, PWM deactivated for HB2(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ACTIVE, PWM activated for HB2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB1MODE</name>
              <description>Half-bridge 1 MODE selection</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> PASSIVE_OFF, LS1 and HS1 are off by passive discharge (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> LS1_ON, LS1 is ON</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> HS1_ON, HS1 is ON</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> ACTIVE_OFF, LS1 and HS1 kept off by the active discharge</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFW1</name>
              <description>Active freewheeling for half-bridge 1 during PWM</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, active freewheeling disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, active freewheeling enabled (default)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB1_PWM_EN</name>
              <description>PWM mode for half-bridge 1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> INACTIVE, PWM deactivated for HB1 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ACTIVE, PWM activated for HB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TPRECHG_BNK0</name>
          <description>HB pre-charge and pre-discharge time</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF1E</resetMask>
          <fields>
            <field>
              <name>TPCHG3</name>
              <description>If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPCHG2</name>
              <description>If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2</description>
              <lsb>7</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPCHG1</name>
              <description>If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPCHG_BNK</name>
              <description>Precharge/predischarge time selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PRECHARGE, Precharge time selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>PREDISCHARGE, Predischarge time selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TPRECHG_BNK1</name>
          <description>HB pre-charge and pre-discharge time</description>
          <addressOffset>0x36</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF1E</resetMask>
          <fields>
            <field>
              <name>TPCHG3</name>
              <description>If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1 predischarge time of HB 3</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPCHG2</name>
              <description>If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1 predischarge time of HB 2</description>
              <lsb>7</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPCHG1</name>
              <description>If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1 predischarge time of HB 1</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPCHG_BNK</name>
              <description>Precharge/predischarge time selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PRECHARGE, Precharge time selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>PREDISCHARGE, Predischarge time selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
