jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>ST_ICHG</name>
          <description>Static charge/discharge current</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <resetValue>0x444</resetValue>
          <resetMask>0xFF0E</resetMask>
          <fields>
            <field>
              <name>ICHGST3</name>
              <description>Static charge and discharge currents of HB3</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default - charge 'CHG16,15.3 mA typ., discharge</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICHGST2</name>
              <description>Static charge and discharge currents of HB2</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default - charge 'CHG16,15.3 mA typ., discharge</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICHGST1</name>
              <description>Static charge and discharge currents of HB1</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default - charge 'CHG16,15.3 mA typ., discharge</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_ICHG_BNK0</name>
          <description>HB charge/discharge currents for PWM operation</description>
          <addressOffset>0x3a</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>IDCHG</name>
              <description>If ICHG_BNK =0xxB Discharge current of HBx active MOSFET</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG</name>
              <description>If ICHG_BNK=0xxB Charge current of HBx active MOSFET</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG_BNK</name>
              <description>Banking bits for charge and discharge currents of active MOSFETs</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active MOSFET of HB1 is selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active MOSFET of HB2 is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active MOSFET of HB3 is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW MOSFET of HB1 is selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW MOSFET of HB2 is selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW MOSFET of HB3 is selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_ICHG_BNK1</name>
          <description>HB charge/discharge currents for PWM operation</description>
          <addressOffset>0x3c</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>IDCHG</name>
              <description>If ICHG_BNK =0xxB Discharge current of HBx active MOSFET</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG</name>
              <description>If ICHG_BNK=0xxB Charge current of HBx active MOSFET</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG_BNK</name>
              <description>Banking bits for charge and discharge currents of active MOSFETs</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active MOSFET of HB1 is selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active MOSFET of HB2 is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active MOSFET of HB3 is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW MOSFET of HB1 is selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW MOSFET of HB2 is selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW MOSFET of HB3 is selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_ICHG_BNK2</name>
          <description>HB charge/discharge currents for PWM operation</description>
          <addressOffset>0x3e</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>IDCHG</name>
              <description>If ICHG_BNK =0xxB Discharge current of HBx active MOSFET</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG</name>
              <description>If ICHG_BNK=0xxB Charge current of HBx active MOSFET</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG_BNK</name>
              <description>Banking bits for charge and discharge currents of active MOSFETs</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active MOSFET of HB1 is selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active MOSFET of HB2 is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active MOSFET of HB3 is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW MOSFET of HB1 is selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW MOSFET of HB2 is selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW MOSFET of HB3 is selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_ICHG_BNK4</name>
          <description>HB charge/discharge currents for PWM operation</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>IDCHG</name>
              <description>If ICHG_BNK =0xxB Discharge current of HBx active MOSFET</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG</name>
              <description>If ICHG_BNK=0xxB Charge current of HBx active MOSFET</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG_BNK</name>
              <description>Banking bits for charge and discharge currents of active MOSFETs</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active MOSFET of HB1 is selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active MOSFET of HB2 is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active MOSFET of HB3 is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW MOSFET of HB1 is selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW MOSFET of HB2 is selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW MOSFET of HB3 is selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_ICHG_BNK5</name>
          <description>HB charge/discharge currents for PWM operation</description>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>IDCHG</name>
              <description>If ICHG_BNK =0xxB Discharge current of HBx active MOSFET</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG</name>
              <description>If ICHG_BNK=0xxB Charge current of HBx active MOSFET</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG_BNK</name>
              <description>Banking bits for charge and discharge currents of active MOSFETs</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active MOSFET of HB1 is selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active MOSFET of HB2 is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active MOSFET of HB3 is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW MOSFET of HB1 is selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW MOSFET of HB2 is selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW MOSFET of HB3 is selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_ICHG_BNK6</name>
          <description>HB charge/discharge currents for PWM operation</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>IDCHG</name>
              <description>If ICHG_BNK =0xxB Discharge current of HBx active MOSFET</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG</name>
              <description>If ICHG_BNK=0xxB Charge current of HBx active MOSFET</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ICHG_BNK</name>
              <description>Banking bits for charge and discharge currents of active MOSFETs</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>ACT_HB1, Active MOSFET of HB1 is selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>ACT_HB2, Active MOSFET of HB2 is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>ACT_HB3, Active MOSFET of HB3 is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>FW_HB1, FW MOSFET of HB1 is selected</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>FW_HB2, FW MOSFET of HB2 is selected</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>FW_HB3, FW MOSFET of HB3 is selected</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>RES, reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
