jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>HB_ICHG_MAX</name>
          <description>HB max. pre-charge/pre-discharge in PWM operation current and diagnostic pull-down</description>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <fields>
            <field>
              <name>HB3IDIAG</name>
              <description>Control of HB3 off-state current source and current sink</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> INACTIVE, Pull-down deactivated (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ACTIVE, Pull-down activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB2IDIAG</name>
              <description>Control of HB2 pull-down for off-state diagnostic</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> INACTIVE, Pull-down deactivated (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ACTIVE, Pull-down activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB1IDIAG</name>
              <description>Control of HB1 pull-down for off-state diagnostic</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> INACTIVE, Pull-down deactivated (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ACTIVE, Pull-down activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICHGMAX3</name>
              <description>Maximum drive current of HB3 during the pre-charge and pre-discharge phases1)</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 31mA, charge ICHG24 typ. 31.6 mA, discharge IDCHG24 typ. 30.9 mA (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 52mA, charge ICHG32 typ. 52.5 mA, discharge IDCHG32 typ. 51.5 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> 112mA, charge ICHG52 typ. 112.2mA, discharge IDCHG52 typ. 110.8 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> 150mA, charge ICHG63 typ. 150 mA, discharge IDCHG63 typ. 150 mA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICHGMAX2</name>
              <description>Maximum drive current of HB2 during the pre-charge phase and pre-discharge phases1)</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 31mA, charge ICHG24 typ. 31.6 mA, discharge IDCHG24 typ. 30.9 mA (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 52mA, charge ICHG32 typ. 52.5 mA, discharge IDCHG32 typ. 51.5 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> 112mA, charge ICHG52 typ. 112.2mA, discharge IDCHG52 typ. 110.8 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> 150mA, charge ICHG63 typ. 150 mA, discharge IDCHG63 typ. 150 mA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICHGMAX1</name>
              <description>Maximum drive current of HB1 during the pre-charge and pre-discharge phases1)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 31mA, charge ICHG24 typ. 31.6 mA, discharge IDCHG24 typ. 30.9 mA (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 52mA, charge ICHG32 typ. 52.5 mA, discharge IDCHG32 typ. 51.5 mA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> 112mA, charge ICHG52 typ. 112.2mA, discharge IDCHG52 typ. 110.8 mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> 150mA, charge ICHG63 typ. 150 mA, discharge IDCHG63 typ. 150 mA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_PCHG_INIT_BNK0</name>
          <description>HBx pre-charge/pre-discharge initialization configuration in PWM operation</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>PDCHGINIT</name>
              <description>Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PCHGINIT</name>
              <description>Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT_BNK</name>
              <description>Banking bits for Precharge an Predischarge Initial</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, precharge/discharge init. for HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, precharge/discharge init. for HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, precharge/discharge init. for HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_PCHG_INIT_BNK1</name>
          <description>HBx pre-charge/pre-discharge initialization configuration in PWM operation</description>
          <addressOffset>0x4a</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>PDCHGINIT</name>
              <description>Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PCHGINIT</name>
              <description>Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT_BNK</name>
              <description>Banking bits for Precharge an Predischarge Initial</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, precharge/discharge init. for HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, precharge/discharge init. for HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, precharge/discharge init. for HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HB_PCHG_INIT_BNK2</name>
          <description>HBx pre-charge/pre-discharge initialization configuration in PWM operation</description>
          <addressOffset>0x4c</addressOffset>
          <size>16</size>
          <resetValue>0x3CD0</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>PDCHGINIT</name>
              <description>Initial predischarge current of HBx, IPDCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001111B</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PCHGINIT</name>
              <description>Initial precharge current of HBx, IPCHGINITx The INIT_BNK bits select the addressed half-bridge Default 001101B Refer to Table 34</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT_BNK</name>
              <description>Banking bits for Precharge an Predischarge Initial</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, precharge/discharge init. for HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, precharge/discharge init. for HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, precharge/discharge init. for HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDON_HB_CTRL_BNK0</name>
          <description>HBx inputs TDON configuration</description>
          <addressOffset>0x4e</addressOffset>
          <size>16</size>
          <resetValue>0xC00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDON</name>
              <description>Turn-on delay time of active MOSFET of HBx</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default 00  640 ns typ.</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB_TDON_BNK</name>
              <description>Banking bits for turn-on delay time</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, tDON of HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, tDON of HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, tDON of HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDON_HB_CTRL_BNK1</name>
          <description>HBx inputs TDON configuration</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <resetValue>0xC00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDON</name>
              <description>Turn-on delay time of active MOSFET of HBx</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default 00  640 ns typ.</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB_TDON_BNK</name>
              <description>Banking bits for turn-on delay time</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, tDON of HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, tDON of HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, tDON of HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDON_HB_CTRL_BNK2</name>
          <description>HBx inputs TDON configuration</description>
          <addressOffset>0x52</addressOffset>
          <size>16</size>
          <resetValue>0xC00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDON</name>
              <description>Turn-on delay time of active MOSFET of HBx</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default 00  640 ns typ.</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB_TDON_BNK</name>
              <description>Banking bits for turn-on delay time</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, tDON of HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, tDON of HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, tDON of HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>RES, reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDOFF_HB_CTRL_BNK0</name>
          <description>HBx TDOFF configuration</description>
          <addressOffset>0x54</addressOffset>
          <size>16</size>
          <resetValue>0xC00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDOFF</name>
              <description>Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default 0000  640 ns</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB_TDOFF_BNK</name>
              <description>Banking bits for turn-off delay time</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, tDOFF of HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, tDOFF of HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, tDOFF of HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
