jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>TDOFF_HB_CTRL_BNK1</name>
          <description>HBx TDOFF configuration</description>
          <addressOffset>0x56</addressOffset>
          <size>16</size>
          <resetValue>0xC00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDOFF</name>
              <description>Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default 0000  640 ns</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB_TDOFF_BNK</name>
              <description>Banking bits for turn-off delay time</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, tDOFF of HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, tDOFF of HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, tDOFF of HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDOFF_HB_CTRL_BNK2</name>
          <description>HBx TDOFF configuration</description>
          <addressOffset>0x58</addressOffset>
          <size>16</size>
          <resetValue>0xC00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDOFF</name>
              <description>Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK bits selects the turn-off delay time of the active MOSFET of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Default 0000  640 ns</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB_TDOFF_BNK</name>
              <description>Banking bits for turn-off delay time</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>HB1, tDOFF of HB1 selected (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>HB2, tDOFF of HB2 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>HB3, tDOFF of HB3 selected</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BRAKE</name>
          <description>Brake control</description>
          <addressOffset>0x5a</addressOffset>
          <size>16</size>
          <resetValue>0xA0</resetValue>
          <resetMask>0xFF1E</resetMask>
          <fields>
            <field>
              <name>SLAM_LS3_DIS</name>
              <description>LS3 output disable during SLAM mode</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ACTIVE, LS3 control active in Slam mode (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, LS3 control disabled in Slam mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLAM_LS2_DIS</name>
              <description>LS2 output disable during SLAM mode</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ACTIVE, LS2 control active in Slam mode (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, LS2 control disabled in Slam mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLAM_LS1_DIS</name>
              <description>LS1 output disable during SLAM mode</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ACTIVE, LS1 control active in Slam mode (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, LS1 control disabled in Slam mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLAM</name>
              <description>Slam mode</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> INACTIVE, Slam mode deactivated (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> AVTIVE, Slam mode activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDSTH_BRK</name>
              <description>VDS Overvoltage for LS1-3 during braking</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 800mV, VVDSMONTH0_BRAKE, 0.8 V, typ. (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 220mV, VVDSMONTH1_BRAKE, 0.22 V typ.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBLK_BRK</name>
              <description>Blank time of VDS overvoltage during braking</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 7uS, tBLK_BRAKE1,7 us typ.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 11uS, tBLK_BRAKE2, 11 us typ. (default)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARK_BRK_EN</name>
              <description>Parking brake enable</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Parking brake disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, Parking brake enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OV_BRK_EN</name>
              <description>Overvoltage brake enable</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Overvoltage brake disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, Overvoltage brake enabled (default)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OV_BRK_TH</name>
              <description>Overvoltage brake threshold</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>27V, typ. 27V (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>28V, typ. 28V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>29V, typ. 29V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>30V, typ. 30V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>31V, typ. 31V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>32V, typ. 32V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>33V, typ. 33V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>34V, typ. 34V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_CTRL</name>
          <description>CAN Selective Wake Control</description>
          <addressOffset>0x5c</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xF1</resetMask>
          <fields>
            <field>
              <name>OSC_CAL</name>
              <description>Oscillator Calibration Mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, Oscillator Calibration is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, Oscillator Calibration is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_EN</name>
              <description>(Un)locking mechanism of oscillator recalibration</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOCKED, locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> LOCKED, locked</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> LOCKED, locked</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> UNLOCKED, unlocked</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANTO_MASK</name>
              <description>CAN Time Out Masking</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> MASKED, CAN time-out is masked - no interrupt (on pin INTN) is triggered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> UNMASKED, CAN time-out is signaled on INTN</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG_VAL</name>
              <description>SWK Configuration valid</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NOT_VALID, Configuration is not valid (SWK not possible)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> VALID, SWK configuration valid, needs to be set to enable SWK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_BTL1_CTRL</name>
          <description>SWK Bit Timing Control</description>
          <addressOffset>0x5e</addressOffset>
          <size>16</size>
          <resetValue>0xCC96</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SP</name>
              <description>Sampling Point Position</description>
              <lsb>10</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TBIT</name>
              <description>Number of Time Quanta in a Bit Time</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_ID1_CTRL</name>
          <description>SWK WUF Identifier bits 28...13</description>
          <addressOffset>0x60</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>ID28</name>
              <description>WUF Identifier Bit 28</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID27</name>
              <description>WUF Identifier Bit 27</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID26</name>
              <description>WUF Identifier Bit 26</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID25</name>
              <description>WUF Identifier Bit 25</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID24</name>
              <description>WUF Identifier Bit 24</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID23</name>
              <description>WUF Identifier Bit 23</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID22</name>
              <description>WUF Identifier Bit 22</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID21</name>
              <description>WUF Identifier Bit 21</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID20</name>
              <description>WUF Identifier Bit 20</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID19</name>
              <description>WUF Identifier Bit 19</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID18</name>
              <description>WUF Identifier Bit 18</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID17</name>
              <description>WUF Identifier Bit 17</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID16</name>
              <description>WUF Identifier Bit 16</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID15</name>
              <description>WUF Identifier Bit 15</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID14</name>
              <description>WUF Identifier Bit 14</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ID13</name>
              <description>WUF Identifier Bit 13</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
