jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>SWK_MASK_ID0_CTRL</name>
          <description>SWK WUF Identifier Mask bits 12...0</description>
          <addressOffset>0x66</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>MASK_ID12</name>
              <description>WUF Identifier Mask Bit 12</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID11</name>
              <description>WUF Identifier Mask Bit 11</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID10</name>
              <description>WUF Identifier Mask Bit 10</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID9</name>
              <description>WUF Identifier Mask Bit 9</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID8</name>
              <description>WUF Identifier Mask Bit 8</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID7</name>
              <description>WUF Identifier Mask Bit 7</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID6</name>
              <description>WUF Identifier Mask Bit 6</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID5</name>
              <description>WUF Identifier Mask Bit 5</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID4</name>
              <description>WUF Identifier Mask Bit 4</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID3</name>
              <description>WUF Identifier Mask Bit 3</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID2</name>
              <description>WUF Identifier Mask Bit 2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID1</name>
              <description>WUF Identifier Mask Bit 1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_ID0</name>
              <description>WUF Identifier Mask Bit 0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> UNMASKED, Unmasked - bit is ignored</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> MASKED, Masked - bit is compared in CAN frame</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_DLC_CTRL</name>
          <description>SWK Frame Data Length Code Control</description>
          <addressOffset>0x68</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <fields>
            <field>
              <name>DLC</name>
              <description>Payload length in number of bytes </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>0, Frame Data Length = 0 or cleared</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>1, Frame Data Length = 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>2, Frame Data Length = 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>3, Frame Data Length = 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>4, Frame Data Length = 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>5, Frame Data Length = 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>6, Frame Data Length = 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>7, Frame Data Length = 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value9</name>
                  <description>8, to 1111B Frame Data Length = 8</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_DATA3_CTRL</name>
          <description>SWK Data7-Data6 Register</description>
          <addressOffset>0x6a</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>DATA7</name>
              <description>Data7 byte content(bit0=LSB; bit7=MSB)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA6</name>
              <description>Data6 byte content(bit0=LSB; bit7=MSB)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_DATA2_CTRL</name>
          <description>SWK Data5-Data4 Register</description>
          <addressOffset>0x6c</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>DATA5</name>
              <description>Data5 byte content(bit0=LSB; bit7=MSB)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA4</name>
              <description>Data4 byte content(bit0=LSB; bit7=MSB)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_DATA1_CTRL</name>
          <description>SWK Data3-Data2 Register</description>
          <addressOffset>0x6e</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>DATA3</name>
              <description>Data3 byte content(bit0=LSB; bit7=MSB)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA2</name>
              <description>Data2 byte content(bit0=LSB; bit7=MSB)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_DATA0_CTRL</name>
          <description>SWK Data1-Data0 Register</description>
          <addressOffset>0x70</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>DATA1</name>
              <description>Data1 byte content(bit0=LSB; bit7=MSB)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA0</name>
              <description>Data0 byte content(bit0=LSB; bit7=MSB)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_CAN_FD_CTRL</name>
          <description>CAN FD Configuration Control Register</description>
          <addressOffset>0x72</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x2F</resetMask>
          <fields>
            <field>
              <name>DIS_ERR_CNT</name>
              <description>Error Counter Disable Function</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write-hardware</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> ENABLED, Error Counter is enabled during SWK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DISABLED, Error counter is disabled during SWK only if CAN_FD_EN = '1'</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FD_FILTER</name>
              <description>CAN FD Dominant Filter Time</description>
              <lsb>1</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description>50ns, 50 ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>100ns, 100 ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>150ns, 150 ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>200ns, 200 ns</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>250ns, 250 ns</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>300ns, 300 ns</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>350ns, 350 ns</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value8</name>
                  <description>775ns, 775 ns</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_FD_EN</name>
              <description>Enable CAN FD Tolerant Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, CAN FD Tolerant Mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, CAN FD Tolerant Mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_OSC_TRIM_CTRL</name>
          <description>SWK Oscillator Trimming and option Register</description>
          <addressOffset>0x74</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF4E</resetMask>
          <fields>
            <field>
              <name>RX_WK_SEL</name>
              <description>SWK Receiver selection (only accessible if TRIM_EN = '11')</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW_POWER, Low-Power Receiver selected during SWK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> STD, Standard Receiver selected during SWK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP_COEF</name>
              <description>Trimming of temp_coef (only writable if TRIM_EN = '11')</description>
              <lsb>7</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_OSC</name>
              <description>Trimming of oscillator (only writable if</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_OSC_CAL_STAT</name>
          <description>SWK Oscillator Calibration Register</description>
          <addressOffset>0x76</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>OSC_CAL_H</name>
              <description>Oscillator Calibration High Register</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_CAL_L</name>
              <description>Oscillator Calibration Low Register</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
