jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>SWK_CDR_CTRL</name>
          <description>Clock Data Recovery Control Register</description>
          <addressOffset>0x78</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x6D</resetMask>
          <fields>
            <field>
              <name>SEL_OSC_CLK</name>
              <description>Input Frequency for CDR module</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SELFILT</name>
              <description>Select Time Constant of Filter</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> 8, Time constant 8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 16, Time constant 16 (default)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> 32, Time constant 32</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> ADAPTIVE, adapt distance between falling edges 2, 3 bit Time constant 32; distance between falling edges 4, 5, 6, 7, 8 bit Time constant 16; distance between falling edges 9, 10 bit Time constant 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDR_EN</name>
              <description>Enable CDR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, CDR disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, CDR enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_CDR_LIMIT</name>
          <description>SWK Clock Data Recovery Limit Control</description>
          <addressOffset>0x7a</addressOffset>
          <size>16</size>
          <resetValue>0x9D8F</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>CDR_LIM_H</name>
              <description>Upper Bit Time Detection Range of Clock and Data</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CDR_LIM_L</name>
              <description>Lower Bit Time Detection Range of Clock and Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SUP_STAT</name>
          <description>Supply Voltage Fail Status</description>
          <addressOffset>0x7c</addressOffset>
          <size>16</size>
          <resetValue>0x8000</resetValue>
          <resetMask>0xFF9E</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>Power-On reset detection</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_POR, No POR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> POR, POR occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP_OT</name>
              <description>Charge pump overtemperature</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_CP_OT, No charge pump OT detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> CP_OT, Charge pump OT detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCC1_UV_FS</name>
              <description>4th consecutive VCC1 UV-Detection</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_FAILSAFE, No Fail-Safe Mode entry due to 4th consecutive VCC1_UV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> FAILSAFE, Fail-Safe Mode entry due to 4th consecutive VCC1_UV</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS_UV</name>
              <description>HS Supply UV-Detection</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_UV, No Undervoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> UV_EVENT, HS Supply Undervoltage detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS_OV</name>
              <description>HS Supply OV-Detection</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No Overvoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV_EVENT, HS Supply Overvoltage detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSINT_UV</name>
              <description>VSINT UV-Detection</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_UV, No Undervoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> UV_EVENT, VSINT Undervoltage detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSINT_OV</name>
              <description>VSINT OV-Detection</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No Overvoltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV_EVENT, VSINT Overvoltage detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS_UV</name>
              <description>VS Undervoltage Detection (VS,UV)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_VS, No VS undervoltage detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> VS_EVENT, VS undervoltage detected (detection is only active when VCC1 is enabled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS_OV</name>
              <description>VS Overvoltage Detection (VS,OV)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No VS overvoltage detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV_EVENT, VS overvoltage detected (detection is only active when VCC1 is enabled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CP_UV</name>
              <description>CP_UV</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_UV, No CP undervoltage detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> UV_EVENT, CP undervoltage detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCC1_SC</name>
              <description>VCC1 SC</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_SC, No VCC1 short to GND detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> SC_EVENT, VCC1 short to GND</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCC1_UV</name>
              <description>VCC1 UV-Detection (due to Vrtx reset)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_UV, No VCC1_UV detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> UV_EVENT, VCC1 undervoltage detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCC1_OV</name>
              <description>VCC1 Overvoltage Detection</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No VCC1 overvoltage warning</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV_EVENT, VCC1 overvoltage detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCC1_WARN</name>
              <description>VCC1 Undervoltage Prewarning</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_UV, No VCC1 undervoltage prewarning</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> UV_PREWARN, VCC1 undervoltage prewarning detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>THERM_STAT</name>
          <description>Thermal Protection Status</description>
          <addressOffset>0x7e</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <fields>
            <field>
              <name>TSD2_SAFE</name>
              <description>TSD2 Thermal Shut-Down Safe State Detection</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_TSD2_SF, No TSD2 safe state detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> TSD2_SF, TSD2 safe state detected &gt;16 consecutive TSD2 events occurred, next TSD2 waiting time will be 64s</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSD2</name>
              <description>TSD2 Thermal Shut-Down Detection</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_TSD2, No TSD2 event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> TSD2_EVENT, TSD2 OT detected - leading to Fail-Safe Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSD1</name>
              <description>TSD1 Thermal Shut-Down Detection</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_TSD1, No TSD1 fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> TSD1_EVENT, TSD1 OT detected (affected module is disabled)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPW</name>
              <description>Thermal Pre Warning</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_TPW, No Thermal Pre warning</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> TPW, Thermal Pre warning detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
