jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>DEV_STAT</name>
          <description>Device Information Status</description>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xDF02</resetMask>
          <fields>
            <field>
              <name>CRC_STAT</name>
              <description>CRC STAT Information</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> DISABLED, CRC disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ENABLED, CRC enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_FAIL</name>
              <description>CRC Fail Information1)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_FAIL, No CRC Failure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> FAIL, CRC Failure detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEV_STAT</name>
              <description>Device Status before Restart Mode</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> CLEARED, Cleared (Register must be actively cleared)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> RESTART, Restart due to failure (WD fail, TSD2, VCC1_UV, trial to access Sleep Mode without any wake source activated); also after a wake from Fail-Safe Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> SLEEP, Sleep Mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> , reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_DEV</name>
              <description>Status of Operating Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>rh</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NORMAL, Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> SW_DEV, Software Development Mode is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WD_FAIL</name>
              <description>Number of WD-Failure Events</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>rh</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_FAIL, No WD Fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> 1x, 1x WD Fail,</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> 2x, 2x WD Fail</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> 3x, more than 3xWD Fail</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI_FAIL</name>
              <description>SPI Fail Information</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_FAIL, No SPI fail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> INVALID, Invalid SPI command detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAILURE</name>
              <description>Failure detection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_FAIL, No Failure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> FAIL, Failure occured</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_STAT</name>
          <description>Bus Communication Status</description>
          <addressOffset>0x82</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CANTO</name>
              <description>CAN Time Out Detection</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_FAIL, Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> TIME_OUT, CAN Time Out detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSERR</name>
              <description>SWK System Error</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_FAIL, Selective Wake Mode is possible</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> FAIL, System Error detected, SWK enabling not possible</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_FAIL</name>
              <description>CAN failure status</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_ERR, No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> CAN_TSD, CAN Thermal shutdown</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> CAN_TXD_DOM_TO, CAN_TXD_DOM TXD dominant time out detected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description> CAN_BUS_DOM_TO, CAN_BUS_DOM BUS dominant time out detected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCAN_UV</name>
              <description>Under Voltage CAN Bus Supply</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NORMAL, Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> UNDERVOLTAGE, CAN Supply undervoltage detected. Transmitter disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WK_STAT</name>
          <description>Wake-up Source and Information Status</description>
          <addressOffset>0x84</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x9B02</resetMask>
          <fields>
            <field>
              <name>CAN_WU</name>
              <description>Wake up via CAN Bus</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_WU, No Wake up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WU, Wake up detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER2_WU</name>
              <description>Wake up via Timer2</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_WU, No Wake up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WU, Wake up detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER1_WU</name>
              <description>Wake up via Timer1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_WU, No Wake up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WU, Wake up detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK5_WU</name>
              <description>Wake up via WK5</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_WU, No Wake up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WU, Wake up detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK4_WU</name>
              <description>Wake up via WK4</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_WU, No Wake up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WU, Wake up detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WK_LVL_STAT</name>
          <description>WK Input Level</description>
          <addressOffset>0x86</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x18</resetMask>
          <fields>
            <field>
              <name>WK5_LVL</name>
              <description>Status of WK5</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, Low Level (=0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, High Level (=1)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WK4_LVL</name>
              <description>Status of WK4</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, Low Level (=0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, High Level (=1)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HS_OL_OC_OT_STAT</name>
          <description>High-Side Switch Status</description>
          <addressOffset>0x88</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>HS3_OT</name>
              <description>Overtemperature Detection on HS3</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OT, No OT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OT, OT detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS2_OT</name>
              <description>Overtemperature Detection on HS2</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OT, No OT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OT, OT detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS1_OT</name>
              <description>Overtemperature Detection on HS1</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OT, No OT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OT, OT detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS3_OL</name>
              <description>Open-Load Detection on HS3</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OL, No OL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OL, OL detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS2_OL</name>
              <description>Open-Load Detection on HS2</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OL, No OL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OL, OL detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS1_OL</name>
              <description>Open-Load Detection on HS1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OL, No OL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OL, OL detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS3_OC</name>
              <description>Overcurrent Detection on HS3</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OC, No OC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OC, OC detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS2_OC</name>
              <description>Overcurrent Detection on HS2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OC, No OC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OC, OC detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS1_OC</name>
              <description>Overcurrent Detection on HS1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OC, No OC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OC, OC detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
