jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>GEN_STAT</name>
          <description>General Status register</description>
          <addressOffset>0x8a</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF00</resetMask>
          <fields>
            <field>
              <name>HB3VOUT</name>
              <description>Voltage level at VSH3 when HB3MODE[10] = 11 and CPEN=1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, VSH3 = Low  VS - VSH3 &gt; VHS3VDSTHx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, VSH3 = High VS - VSH3  VHS3VDSTHx</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB2VOUT</name>
              <description>Voltage level at VSH2 when HB2MODE[10] = 11 and CPEN=1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, VSH2 = Low  VS - VSH2 &gt; VHS2VDSTHx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, VSH2 = High VS - VSH2  VHS2VDSTHx</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HB1VOUT</name>
              <description>Voltage level at VSH1 when HB1MODE[10] = 11 and CPEN=1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, VSH1 = Low  VS - VSH1 &gt; VHS1VDSTHx</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, VSH1 = High VS - VSH1  VHS1VDSTHx</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM6STAT</name>
              <description>PWM6 status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, PWM6 is Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, PWM6 is High</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM5STAT</name>
              <description>PWM5 status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, PWM5 is Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, PWM5 is High</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM4STAT</name>
              <description>PWM4 Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, PWM4 is Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, PWM4 is High</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM3STAT</name>
              <description>PWM3 status</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, PWM3 is Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, PWM3 is High</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM2STAT</name>
              <description>PWM2 Status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, PWM2 is Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, PWM2 is High</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM1STAT</name>
              <description>PWM1/CRC status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> LOW, PWM1/CRC is Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> HIGH, PWM1/CRC is High</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TDREG</name>
          <description>Turn-on/off delay regulation register</description>
          <addressOffset>0x8c</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x7706</resetMask>
          <fields>
            <field>
              <name>IPDCHG3_ST</name>
              <description>HB3 predischarge status</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> CLAMP, the predischarge current is equal to</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>0.5 mA typ. or ICHGMAX3 if AGC[10] = or 11B,</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> NO_CLAMP, 0.5 mA &lt; predischarge current &lt; ICHGMAX31)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPDCHG2_ST</name>
              <description>HB2 predischarge status</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> CLAMP, the predischarge current is equal to</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>0.5 mA typ. or ICHGMAX2 if AGC[10] = or 11B,</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description> NO_CLAMP, 0.5 mA &lt; predischarge current &lt; ICHGMAX21)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPDCHG1_ST</name>
              <description>HB1 predischarge status</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> CLAMP, the predischarge current is equal to the 0.5 mA typ. or ICHGMAX1 if AGC[10] = 1or 11B, and HBx_PWM_EN = 11)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> NO_CLAMP, 0.5 mA &lt; predischarge current &lt; ICHGMAX11)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPCHG3_ST</name>
              <description>HB3 precharge status</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> CLAMP, the precharge current is equal to 0.5 mA typ. or ICHGMAX3 if AGC[10] = 1or 11B, and HB3_PWM_EN = 11)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> NO_CLAMP, 0.5 mA &lt; precharge current &lt; ICHGMAX31)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPCHG2_ST</name>
              <description>HB2 precharge status</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> CLAMP, the precharge current is equal to 0.5 mA typ. or ICHGMAX2 if AGC[10] = 1or 11B, and HB2_PWM_EN = 11)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> NO_CLAMP, 0.5 mA &lt; precharge current &lt; ICHGMAX21)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPCHG1_ST</name>
              <description>HB1 precharge status</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> CLAMP, the precharge current is equal to the 0.5 mA typ. or ICHGMAX1 if AGC[10] = 1or 11B, and HB1_PWM_EN = 11)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> NO_CLAMP, 0.5 mA &lt; precharge current &lt; ICHGMAX11)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDREG3</name>
              <description>HB3 Regulation of turn-on/off delay</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_REG, tDON3 and tDOFF3 are not in regulation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> REG, tDON3 and/or tDOFF3 are in regulation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDREG2</name>
              <description>HB2 Regulation of turn-on/off delay</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_REG, tDON2 and tDOFF2 are not in regulation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> REG, tDON2 and/or tDOFF2 are in regulation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDREG1</name>
              <description>HB1 Regulation of turn-on/off delay</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_REG, tDON and tDOFF are not in regulation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> REG, tDON and/or tDOFF are in regulation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
