jassony/infineon2b6/ConfigWizard/TLE9563_3QX.svd
        <register>
          <name>DSOV</name>
          <description>Drain-source overvoltage</description>
          <addressOffset>0x8e</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F76</resetMask>
          <fields>
            <field>
              <name>OC_CSA</name>
              <description>CSA Overcurrent detection</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OC, No overcurrent detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OC, Overcurrent detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSINTOVBRAKE_ST</name>
              <description>VSINT Brake status</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NOT_DETECT, VSINT overvoltage brake condition is not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DETECT, VSINT overvoltage brake conditions is detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSOVBRAKE_ST</name>
              <description>VS Brake status</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NOT_DETECT, VS overvoltage brake conditions is not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> DETECT, VS overvoltage brake conditions is detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LS3DSOV_BRK</name>
              <description>Drain-source overvoltage on low-side 3 during braking</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on LS3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on LS3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LS2DSOV_BRK</name>
              <description>Drain-source overvoltage on low-side 2 during braking</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on LS2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on LS2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LS1DSOV_BRK</name>
              <description>Drain-source overvoltage on low-side 1 during braking</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on LS1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on LS1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LS3DSOV</name>
              <description>Drain-source overvoltage on low-side 3</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on LS3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on LS3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS3DSOV</name>
              <description>Drain-source overvoltage on high-side 3</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on HS3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on HS3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LS2DSOV</name>
              <description>Drain-source overvoltage on low-side 2</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on LS2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on LS2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS2DSOV</name>
              <description>Drain-source overvoltage on high-side 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on HS2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on HS2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LS1DSOV</name>
              <description>Drain-source overvoltage on low-side 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on LS1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on LS1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS1DSOV</name>
              <description>Drain-source overvoltage on high-side 1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_OV, No drain-source overvoltage on HS1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> OV, Drain-source overvoltage on HS1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EFF_TDON_OFF1</name>
          <description>Effective MOSFET turn.on/off delay - HB1</description>
          <addressOffset>0x90</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDOFF1EFF</name>
              <description>Effective active MOSFET turn-off delay HB1</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TDON1EFF</name>
              <description>Effective active MOSFET turn-on delay HB1 Nominal effective tDON1 = 53.3 ns x TDON1EFF[50]D</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFF_TDON_OFF2</name>
          <description>Effective MOSFET turn.on/off delay - HB 2</description>
          <addressOffset>0x92</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDOFF2EFF</name>
              <description>Effective active MOSFET turn-off delay HB2</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TDON2EFF</name>
              <description>Effective active MOSFET turn-on delay HB2 Nominal effective tDON2 = 53.3 ns x TDON2EFF[50]D</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EFF_TDON_OFF3</name>
          <description>Effective MOSFET turn.on/off delay - HB3</description>
          <addressOffset>0x94</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TDOFF3EFF</name>
              <description>Effective active MOSFET turn-off delay HB3 Nominal effective tDOFF3 = 53.3 ns x TDO3EFF[138]D</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TDON3EFF</name>
              <description>Effective active MOSFET turn-on delay HB3 Nominal effective tDON3 = 53.3 ns x TDON3EFF[50]D</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE_FALL1</name>
          <description>MOSFET rise/fall time - HB1</description>
          <addressOffset>0x96</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TFALL1</name>
              <description>Active MOSFET fall time HB1</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRISE1</name>
              <description>Active MOSFET rise time HB1</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE_FALL2</name>
          <description>MOSFET rise/fall time - HB2</description>
          <addressOffset>0x98</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TFALL2</name>
              <description>Active MOSFET fall time HB2</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRISE2</name>
              <description>Active MOSFET rise time HB2</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE_FALL3</name>
          <description>MOSFET rise/fall time - HB3</description>
          <addressOffset>0x9a</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F3E</resetMask>
          <fields>
            <field>
              <name>TFALL3</name>
              <description>Active MOSFET fall time HB3</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRISE3</name>
              <description>Active MOSFET rise time HB3</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_STAT</name>
          <description>Selective Wake Status</description>
          <addressOffset>0x9c</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x7C</resetMask>
          <fields>
            <field>
              <name>SYNC</name>
              <description>Synchronisation (at least one CAN frame without fail must have been received)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_SYNC, SWK function not working or not synchronous to CAN bus</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> SYNC, Valid CAN frame received, SWK function is synchronous to CAN bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUP</name>
              <description>Wake-up Pattern Detection</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_WUP, No WUP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WUP_DETECTED, WUP detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF</name>
              <description>SWK Wake-up Frame Detection</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-clear</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_WUF, No WUF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> WUF_DETECTED, WUF detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANSIL</name>
              <description>CAN Silent Time during SWK operation</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> NO_SIL, tsilence not exceeded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> SIL_EXCEEDED, set if tsilence is exceeded.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWK_SET</name>
              <description>Selective Wake Activity</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value1</name>
                  <description> INACTIVE, Selective Wake is not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description> ACTIVE, Selective Wake is activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_ECNT_STAT</name>
          <description>Selective Wake ECNT Status</description>
          <addressOffset>0x9e</addressOffset>
          <size>16</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>ECNT</name>
              <description>SWK CAN Frame Error Counter</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWK_CDR_STAT</name>
          <description>Selective Wake CDR Status</description>
          <addressOffset>0xa0</addressOffset>
          <size>16</size>
          <resetValue>0xA000</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>N_AVG</name>
              <description>Output Value from Filter Block</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAM_PROD_STAT</name>
          <description>Family and Product Identification Register</description>
          <addressOffset>0xa2</addressOffset>
          <size>16</size>
          <resetValue>0x402</resetValue>
          <resetMask>0xFF06</resetMask>
          <fields>
            <field>
              <name>FAM</name>
              <description>Device Family Identifier</description>
              <lsb>7</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PROD</name>
              <description>Device Product Identifier</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
